In [1]:
import pandas as pd

In [2]:
people = {
    "first" :["Ram","Hari","Shyam"],
    "last" : ["Thapa","Paudel","Thapa"],
    "email" : ["ramthaapa@gmail.com","haripaudel@gmail.com","shyamthapa@gmail.com"] 
    

}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first    last                 email
0    Ram   Thapa   ramthaapa@gmail.com
1   Hari  Paudel  haripaudel@gmail.com
2  Shyam   Thapa  shyamthapa@gmail.com

In [5]:
df['first']+' '+df['last']  # combining first and last into a single column

0      Ram Thapa
1    Hari Paudel
2    Shyam Thapa
dtype: object

In [6]:
df['full_name'] =df['first']+' '+df['last'] # this adds a new column full_name which has combined data of first and last

In [7]:
df

   first    last                 email    full_name
0    Ram   Thapa   ramthaapa@gmail.com    Ram Thapa
1   Hari  Paudel  haripaudel@gmail.com  Hari Paudel
2  Shyam   Thapa  shyamthapa@gmail.com  Shyam Thapa

In [8]:
df.drop(columns=['first','last']) # this deletes/drops the columns having name first and last

# this just gives the view that how the dataframe looks like,it doesn't actually apply those changes
# and if we are happy with the changes then we can change our dataframe setting inplace argument True as follows

                  email    full_name
0   ramthaapa@gmail.com    Ram Thapa
1  haripaudel@gmail.com  Hari Paudel
2  shyamthapa@gmail.com  Shyam Thapa

In [9]:
df.drop(columns=['first','last'],inplace=True)

In [10]:
df

                  email    full_name
0   ramthaapa@gmail.com    Ram Thapa
1  haripaudel@gmail.com  Hari Paudel
2  shyamthapa@gmail.com  Shyam Thapa

In [11]:
# splitting the full_name column as before

df['full_name'].str.split(' ',expand = True)

       0       1
0    Ram   Thapa
1   Hari  Paudel
2  Shyam   Thapa

In [12]:
df[['first','last']] =df['full_name'].str.split(' ',expand = True) # this adds first and last column in the dataframe

In [13]:
df

                  email    full_name  first    last
0   ramthaapa@gmail.com    Ram Thapa    Ram   Thapa
1  haripaudel@gmail.com  Hari Paudel   Hari  Paudel
2  shyamthapa@gmail.com  Shyam Thapa  Shyam   Thapa

In [14]:
# adding a single row 
# we can do this using .append method
#df.append({'first':'Aashish'})  

# this gives TypeError because Can only append a dict if ignore_index=True

In [15]:
df.append({'first':'Aashish'},ignore_index=True)  
# this is giving a FutureWarning that: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.

/tmp/ipykernel_5793/1670232835.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first':'Aashish'},ignore_index=True)

                  email    full_name    first    last
0   ramthaapa@gmail.com    Ram Thapa      Ram   Thapa
1  haripaudel@gmail.com  Hari Paudel     Hari  Paudel
2  shyamthapa@gmail.com  Shyam Thapa    Shyam   Thapa
3                   NaN          NaN  Aashish     NaN

In [16]:
# creating another dictionary 

people = {
    "first" :["Rahul","Sunil"],
    "last" : ["Thapa","Oli"],
    "email" : ["rahulthapa@gmail.com","suniloli@gmail.com"] 
} 

# creating another dataframe from this dictionary
df2=pd.DataFrame(people)

In [17]:
df2

   first   last                 email
0  Rahul  Thapa  rahulthapa@gmail.com
1  Sunil    Oli    suniloli@gmail.com

In [18]:
df.append(df2)

/tmp/ipykernel_5793/2094904254.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2)

                  email    full_name  first    last
0   ramthaapa@gmail.com    Ram Thapa    Ram   Thapa
1  haripaudel@gmail.com  Hari Paudel   Hari  Paudel
2  shyamthapa@gmail.com  Shyam Thapa  Shyam   Thapa
0  rahulthapa@gmail.com          NaN  Rahul   Thapa
1    suniloli@gmail.com          NaN  Sunil     Oli

In [19]:
# as .append method is going to deleted from pandas in future ,so using .concat method

pd.concat([df,df2])

# this just gives an overview that afer doing this,how our data looks like ,so to make these changes permanent we do it as
#df =pd.concat([df,df2])

                  email    full_name  first    last
0   ramthaapa@gmail.com    Ram Thapa    Ram   Thapa
1  haripaudel@gmail.com  Hari Paudel   Hari  Paudel
2  shyamthapa@gmail.com  Shyam Thapa  Shyam   Thapa
0  rahulthapa@gmail.com          NaN  Rahul   Thapa
1    suniloli@gmail.com          NaN  Sunil     Oli

In [20]:
df =pd.concat([df,df2],ignore_index = True)

# ignore_index = True so that new index values are displayed in the concatenated DataFrame.

In [21]:
df

                  email    full_name  first    last
0   ramthaapa@gmail.com    Ram Thapa    Ram   Thapa
1  haripaudel@gmail.com  Hari Paudel   Hari  Paudel
2  shyamthapa@gmail.com  Shyam Thapa  Shyam   Thapa
3  rahulthapa@gmail.com          NaN  Rahul   Thapa
4    suniloli@gmail.com          NaN  Sunil     Oli

In [22]:
# dropping or removing a single row

df.drop(index=4)

                  email    full_name  first    last
0   ramthaapa@gmail.com    Ram Thapa    Ram   Thapa
1  haripaudel@gmail.com  Hari Paudel   Hari  Paudel
2  shyamthapa@gmail.com  Shyam Thapa  Shyam   Thapa
3  rahulthapa@gmail.com          NaN  Rahul   Thapa

In [23]:
df

                  email    full_name  first    last
0   ramthaapa@gmail.com    Ram Thapa    Ram   Thapa
1  haripaudel@gmail.com  Hari Paudel   Hari  Paudel
2  shyamthapa@gmail.com  Shyam Thapa  Shyam   Thapa
3  rahulthapa@gmail.com          NaN  Rahul   Thapa
4    suniloli@gmail.com          NaN  Sunil     Oli

In [24]:
# dropping multiple rows 
# df.drop(index=df[df['last']=='Thapa'].index) #dropping multiple rows that has last name 'Thapa'

# we can do this using filter method as
filt = df['last']=='Thapa'
df.drop(index=df[filt].index)

                  email    full_name  first    last
1  haripaudel@gmail.com  Hari Paudel   Hari  Paudel
4    suniloli@gmail.com          NaN  Sunil     Oli